package com.example.dw;

import java.util.ArrayList;

public class Text {

    ArrayList<String> text1 = new ArrayList<>();
    ArrayList<String> n_m1 = new ArrayList<>();
    ArrayList<String> text2 = new ArrayList<>();
    ArrayList<String> n_m2 = new ArrayList<>();


    {
        text1.add("Добро пожаловать, Игрок!\n" +
                "Вы являетесь участником квеста DifWord.\n" +
                "Позвольте представиться, Система.\n"+
                "Пожалуйста укажите как к Вам обращаться?");
        n_m1.add("Система");
        text1.add("*Только ввел имя и он тут же пропал, странно.\n"+" Ладно подумаем обо всем по порядку. Как я тут оказался?* \n");
        n_m1.add("Мысли");
        text1.add( "*И эта игра пройдена, чем же заняться*");
        n_m1.add("Воспоминания");
        text1.add("*Что? От кого?\n" + "От разрабочиков игры DifWord? Никогда о таких не слышал, но все равно же нечем занятся.*");
        n_m1.add("Воспоминания");
        text1.add("\n" + "«Мы восхищены ваши успехами, не желаете принять участие в прохождении квеста DifWord нового нашего проекта? Разумеется вознаграждение гарантированно.\n" +
                "С уважением команда разработчиков DifWorld. »");
        n_m1.add("От разрабочиков игры DifWord");
        text1.add( "*Почему бы не попробовать? – последняя мысль была произнесена вслух и задуманное было тут же исполнено*");
        n_m1.add("Воспоминания");
        text1.add( "Из раздумий меня вывели голоса:\n" +
                "Наконец-то шестой участник, теперь мы сможем начать игру.");
        n_m1.add("???");
        text1.add("Тебе не кажется, что стоит сначала познакомится с ним?");
        n_m1.add("???");
        text1.add("Точно ты прав, прости мне не стоит так спешить…");
        n_m1.add("???");
        text1.add("Я обернулся и заметил приближающуюся ко мне компанию людей.\n" +"Хотя людьми назвать их было сложно:");
        n_m1.add("Мысли");
        text1.add("Мрачная синеволосая леди, с холодным пронзительным взглядом.");
        n_m1.add("???");
        text1.add("Хмурый блондин с длинными волосами и выглядывающими из под них острыми ушками.");
        n_m1.add("???");
        text1.add("Улыбающаяся девушка с черно-красными блестящими рогами.");
        n_m1.add("???");
        text1.add("Доброжелательный юноша с пушистыми ушками, как у котенка.");
        n_m1.add("???");
        text1.add("И усмехающийся парень с красивыми небесно-голубыми крыльями.");
        n_m1.add("???");
        text1.add("Девушка с рожками заговорила первая:");
        n_m1.add("???");
        text1.add("Привет я Мираджейн. Можно просто Мира.");
        n_m1.add("Мира");
        text1.add("Приятно познакомится, я ");
        n_m1.add("Я");
        text1.add(". А, ты…");
        n_m1.add("Я");
        text1.add("Да, я дракон – весело, ничуть не стесняясь, сообщила Мира и познакомила меня с остальными:");
        n_m1.add("Мира");
        text1.add("Это Дэн, он оборотень.\n" + "Привет) – котик улыбнулся.");
        n_m1.add("Дэн");
        text1.add("Это Фрайд, он демон.\n" + "Хай! – крылатый помахал.");
        n_m1.add("Фрайд");
        text1.add("Эпэрфлас эльф.");
        n_m1.add("Эпэрфлас");
        text1.add("И снежная королева Глэдис\n" + "Приветствую - холодно произнесла леди.");
        n_m1.add("Гледис");
        text1.add("Мне очень приятно познакомится с вами.");
        n_m1.add("Я");
        text1.add("Нам тоже, - ответил за всех оборотень.");
        n_m1.add("Дэн");
        text1.add(", ты знаешь где ты и что тут происходит?");
        n_m1.add("Дэн");
        text1.add("Последнее что помню это то, что я согласился участвовать в квесте DifWord.");
        n_m1.add("Я");
        text1.add("Мы все участники …");
        n_m1.add("Дэн");
        text1.add("Игроки – уточнил демон.");
        n_m1.add("Фрайд");
        text1.add("Этого квеста и наша цель пройти все его испытания, тогда мы сможем вернуть в свой мир!");
        n_m1.add("Дэн");
        text1.add("Правильно я понимаю, что оказаться от участия уже нельзя?");
        n_m1.add("Я");
        text1.add("К моему величайшему сожалению — это правда. \n" +"Преувеличенно вздохнул крылатый.");
        n_m1.add("Фрайд");
        text1.add("Будто тебе настолько противно находиться тут, сам же соглашался на прохождение квеста или кто-то тебя заставил или отправил насильно…");
        n_m1.add("Эпэрфлас");
        text1.add("Я не думал, что мне придется терпеть лесную феечку, которая не знает своего ме…");
        n_m1.add("Фрайд");
        text1.add("Прекратите оба! — в разговор вмешалась Мира, прерывая неминуемо начинающеюся драку.");
        n_m1.add("Мира");
        text1.add("Раз все игроки собрались, мы можем начать…");
        n_m1.add("Мира");
        text1.add("Драконша нажала на какую-то кнопку.\n" +" Да начнется игра!!!" );
        n_m1.add("Мира");

    }
    {   //n_m.add("Система");
        text2.add("Добро пожаловать на первый уровень «Жадный алгоритм»");
        n_m2.add("Система");
        text2.add("Возьмите вашу форму. На это уровне вы будете управляющими кафе.\n" +
                "У вас будет ограниченное количество пирожных и напитков. Вам необходимо заработать, как можно больше денег для развития кафе. Выбирайте покупателей с умом!)\n");
        n_m2.add("Система");
        text2.add("Что такое жадный алгоритм?");
        n_m2.add("Дэн");
        text2.add("Что такое кафе?");
        n_m2.add("Мира");
        text2.add("Что за форма? Я против...");
        n_m2.add("Эпэрфлас");
        text2.add("Да ну тебе подойдет, будешь милашкой в ней)");
        n_m2.add("Фрайд");
        text2.add("Ты! Ты...");
        n_m2.add("Эпэрфлас");
        text2.add("Вопрос Дена важнее, чем ваши разборки.\n" + "Все притихли.");
        n_m2.add("Гледис");
        text2.add("Спасибо, Глэди.\n" + "Раз нам сказали, что это уровень про жадный алгоритм,\n" +
                "то наверно нужно выяснить, что же это такое, иначе не сможем его пройти.\n");
        n_m2.add("Дэн");
        text2.add("Так кто-нибудь сталкивался с этим понятием?");
        n_m2.add("Дэн");
        text2.add("...");
        n_m2.add(" ");
        text2.add("Хорошо значит спросим у Системы.");
        n_m2.add("Дэн");
        text2.add("Жадный алгоритм — алгоритм, заключающийся в принятии оптимальных решений на каждом этапе, предполагая, что конечное решение также окажется оптимальным.");
        n_m2.add("Система");
        text2.add("Получается нам нужно выбирать лучший вариант и всe?\n" + "Тогда давайте попробуем!!!" );
        n_m2.add("Мира");
        text2.add("1 День\n" + "всего пироженых 10, всего кофе 10\n" + " Покупатель 1 хочет купить: 10 пироженых за 15 + 5 кофе за 20\n" + " Покупатель 2 хочет купить: 5 пироженых за 15 + 1 кофе за 20\n" + " Покупатель 3 хочет купить: 10 пироженых за 15 + 1 кофе за 20" );
        n_m2.add("Система");
        text2.add("2 День\n" + "всего пироженых 20, всего кофе 15\n" + " Покупатель 1 хочет купить: 20 пироженых за 15 + 10 кофе за 20\n" + " Покупатель 2 хочет купить: 5 пироженых за 15 + 5 кофе за 20\n" + " Покупатель 3 хочет купить: 20 пироженых за 20 + 10 кофе за 20)");
        n_m2.add("Система");
        text2.add("3 День\n" + "всего пироженых 15, всего кофе 10\n" + " Покупатель 1 хочет купить: 15 пироженых за 10 + 5 кофе за 20\n" + " Покупатель 2 хочет купить: 15 пироженых за 15 + 5 кофе за 20\n" + " Покупатель 3 хочет купить: 10 пироженых за 15 + 1 кофе за 20");
        n_m2.add("Система");
    }

    public String ctT (Integer c1, Integer c){
        if(c1 == 0)
            return text1.get(c);
        else
            return text2.get(c);
    }
    public String ctN (Integer c1, Integer c){
        if(c1 == 0)
            return n_m1.get(c);
        else
            return n_m2.get(c);
    }
}
